tap "homebrew/bundle"

# shell
brew "neovim"
brew "tmux"
brew "yadm"
brew "fd"
brew "fzf"
brew "jq"
brew "ripgrep"
brew "awscli"
brew "the_silver_searcher"
brew "curl"
brew "git-delta"
brew "bat"
brew "eza"
brew "tree"
brew "tldr"

# fonts
brew "font-fira-code-nerd-font"
brew "font-jetbrains-mono-nerd-font"

cask "iterm2"
cask "wezterm"
cask "karabiner-elements"
