tap "homebrew/bundle"
tap "homebrew/cask-fonts"

# shell
brew "neovim"
brew "tmux"
brew "yadm"
brew "fd"
brew "fzf"
brew "jq"
brew "ripgrep"
brew "awscli"
brew "dust"
brew "duf"
brew "broot"
brew "the_silver_searcher"
brew "curl"
brew "git-delta"
brew "bottom"
brew "hyperfine"
brew "zoxide"
brew "dog"
brew "bat"
brew "eza"

# fonts
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"

cask "iterm2"
cask "visual-studio-code"
cask "karabiner-elements"
