tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/cask-fonts"
tap "jesseduffield/lazygit"

# apps dev
brew "fastlane"
brew "nvm"
brew "php"
brew "poppler"
brew "curl"
brew "python@3.11"

# shell
brew "neovim"
brew "tmux"
brew "yadm"
brew "fd"
brew "fzf"
brew "jq"
brew "ripgrep"
brew "awscli"

# git
brew "git-delta"
brew "glab"
brew "jesseduffield/lazygit/lazygit"

brew "graphviz"

# fonts
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"

cask "iterm2"
cask "visual-studio-code"
cask "karabiner-elements"
